# converter.py

# Ассоциативный массив для сопоставления английских клавиш русским
EN_TO_RU_MAP = {
    # --- Буквы ---
    'q': 'й', 'w': 'ц', 'e': 'у', 'r': 'к', 't': 'е', 'y': 'н', 'u': 'г', 'i': 'ш', 'o': 'щ', 'p': 'з',
    'a': 'ф', 's': 'ы', 'd': 'в', 'f': 'а', 'g': 'п', 'h': 'р', 'j': 'о', 'k': 'л', 'l': 'д',
    'z': 'я', 'x': 'ч', 'c': 'с', 'v': 'м', 'b': 'и', 'n': 'т', 'm': 'ь',
    
    # --- Спецсимволы (Без Shift) ---
    '`': 'ё',
    '[': 'х', ']': 'ъ',
    ';': 'ж', "'": 'э',
    '\\': '\\', 
    ',': 'б', '.': 'ю', '/': '.',
    
    # --- Цифры/Знаки (Без Shift) ---
    '1': '1', '2': '2', '3': '3', '4': '4', '5': '5', '6': '6', '7': '7', '8': '8', '9': '9', '0': '0',
    '-': '-', '=': '=',

    # --- Верхний регистр (С Shift) ---
    'Q': 'Й', 'W': 'Ц', 'E': 'У', 'R': 'К', 'T': 'Е', 'Y': 'Н', 'U': 'Г', 'I': 'Ш', 'O': 'Щ', 'P': 'З',
    'A': 'Ф', 'S': 'Ы', 'D': 'В', 'F': 'А', 'G': 'П', 'H': 'Р', 'J': 'О', 'K': 'Л', 'L': 'Д',
    'Z': 'Я', 'X': 'Ч', 'C': 'С', 'V': 'М', 'B': 'И', 'N': 'Т', 'M': 'Ь',
    
    # --- Спецсимволы (С Shift) ---
    '~': 'Ё', # Shift + `
    '{': 'Х', '}': 'Ъ', # Shift + [ и Shift + ]
    ':': 'Ж', '"': 'Э', # Shift + ; и Shift + '
    '|': '/', # Shift + \ 
    '<': 'Б', '>': 'Ю', '?': ',', # Shift + , . /
    
    # --- Цифры/Знаки (С Shift) - Поклавишное соответствие по стандарту RU/EN ---
    '!': '!', '@': '"', '#': '№', '$': ';', '%': '%', '^': ':', '&': '?', '*': '*', '(': '(', ')': ')',
    '_': '_', '+': '+'
}

# Обратный массив для сопоставления русских клавиш английским
RU_TO_EN_MAP = {v: k for k, v in EN_TO_RU_MAP.items()}


def convert_text(text: str, current_map: dict) -> str:
    """
    Преобразует строку, используя заданную карту сопоставления раскладок.
    """
    return "".join(current_map.get(char, char) for char in text)
